Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: 2023-05-12T17:27:37.475 info e688494e9da1c6488e5f505b8e65a92e (Server.exe:7280>user:1:) - Инициализирована сессия для пользователя user{"USER_NAME": "user", "SESSION_TYPE": "Интерактивная сессия", "CLIENT_IP": "127.0.0.1", "CLIENT_HOST": "PC-X.bg.local", "HEADERS": "{host=localhost:8080,connection=Upgrade,pragma=no-cache,cache-control=no-cache,"user-agent=Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/112.0.0.0 Safari/537.36",upgrade=websocket,origin=http://localhost,sec-websocket-version=13,"accept-encoding=gzip, deflate, br","accept-language=en-US,en;q=0.9",sec-websocket-key=rO8ZERq8O9UCJ/Np8j9plA==,"sec-websocket-extensions=permessage-deflate; client_max_window_bits"}"}
en: 2023-05-12T17:27:37.475 info e688494e9da1c6488e5f505b8e65a92e (Server.exe:7280>user:1:) - Session initialized for user user{"USER_NAME": "user", "SESSION_TYPE": "Interactive session", "CLIENT_IP": "127.0.0.1", "CLIENT_HOST": "PC-X.bg.local", "HEADERS": "{host=localhost:8080,connection=Upgrade,pragma=no-cache,cache-control=no-cache,"user-agent=Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/112.0.0.0 Safari/537.36",upgrade=websocket,origin=http://localhost,sec-websocket-version=13,"accept-encoding=gzip, deflate, br","accept-language=en-US,en;q=0.9",sec-websocket-key=rO8ZERq8O9UCJ/Np8j9plA==,"sec-websocket-extensions=permessage-deflate; client_max_window_bits"}"}

source: ARIMAX: В Loginom под Linux модель при обучении выдавала одно значения (константу) на весь прогнозный период.
en: ARIMAX: While training the model displayed one value (intercept) in Loginom for Linux for the whole forecast period.

source: Access: при многопоточной работе подключений, использующих «Microsoft Access Database Engine»: «MS Access», «MS Excel», а также подключений через ODBC, возникали ошибки со стороны данного компонента СУБД.
en: Access: In the case of the multithread operation of the connections that use "Microsoft Access Database Engine": "MS Access", "MS Excel", and also connections via ODBC, there were errors connected with this DBMS component.

source: Firebird: не полностью откатывались транзакции в непустую таблицу в режиме «Очистить таблицу и заполнить данными» при выполнении экспорта в базу данных.
en: Firebird: Full roll back of transactions to the nonempty table in "Clear table and append data" mode was not possible when exporting to the database.

source: JavaScript: Исправлена ошибка «Access violation», которая возникала при работе под Linux после перезагрузки сервера при первой одновременной активации нескольких узлов (#10293).
en: JavaScript: "Access violation" error was corrected. It occurred when working with Linux after the server restart when several nodes were simultaneously activated for the first time (#10293).

source: JavaScript: За счет реализации пула интерпретаторов JavaSсript узел JavaScript стал активироваться быстрее (в некоторых случаях ~ в 70 раз).
en: JavaScript: On account of implementation of JavaSсript interpreters pool, JavaScript node is faster activated (in some cases ~ up to 70 times).

source: JavaScript: Исправлена ошибка "Runtime is in exception state", которая возникала при одновременной остановке выполнения скрипта и возникновении ошибки в скрипте.
en: JavaScript: The following error was corrected: "Runtime is in exception state". It occurred when script execution process was stopped and error occurred in script in one and the same time.

source: JavaScript: исправлено появление имени несуществующего модуля в автодополнении кода, подсказки по типам аргументов функций и их возвращаемых значений для модуля «builtIn/Fetch».
en: JavaScript: The error related to occurrence of the name of nonexisting module in the code completion, tip by types of function arguments and their returned values for "builtIn/Fetch" module was corrected.

source: JavaScript: при использовании в цикле с большим количеством вызовов обработчика, потребляемая на сервере оперативная память могла не освобождаться своевременно, а также могли возникать ошибки в стороннем модуле ChakraCore.dll.
en: JavaScript: when using in the loop where handler was called many times, the memory consumed on server was not timely unallocated, and also errors in the third-party module could occur ChakraCore.dll.

source: JavaScript: исправлена ошибка Access violation при выполнении кода atob("") в узле JavaScript (#9295).
en: JavaScript: Access violation error when executing atob("") code in JavaScript node was corrected (#9295).

source: JavaScript, Python: Добавлена возможность активации узлов JavaScript и Python, порты источников данных которых подключены к неактивным ветвям узла Условие.
en: JavaScript, Python: It became possible to activate JavaScript and Python nodes, the data sources ports of which are connected to the inactive branches of the Condition node.

source: Loginom Desktop: В настольной редакции под Linux исправлено отображение результирующего имени файла в заголовке файлового диалога в GTK.
en: Loginom Desktop: Display of the resulting file name in the title of the file dialog in GTK was corrected in the desktop edition for Linux.

source: Loginom Desktop: если в локальной сети был настроен Web Proxy Auto-Discovery (WPAD) Protocol, то приложение автоматически закрывалось через несколько секунд после запуска (#8303).
en: Loginom Desktop: if Web Proxy Auto-Discovery (WPAD) Protocol was set in the local network, the application was automatically closed a few seconds after its start (#8303).

source: Loginom Integrator: Если у Loginom Server и Loginom Integrator не совпадали версии, то после попытки подключения возникала ошибка, а в Loginom Integrator оставались зависшие потоки чтения и записи, которые мешали нормальному завершению работы Loginom Integrator.
en: Loginom Integrator: If Loginom Server and Loginom Integrator versions didn't match each other, an error occurred after connection attempt, and read and write streams were kept frozen in Loginom Integrator. It prevented Loginom Integrator from being shut down normally.

source: Loginom Integrator: Если в Integrator отправлялся REST-запрос методом HTTP POST и в вызываемом пакете возникала ошибка, то возвращался статус 400 (Bad Request), что не соответствовало действительности, так как в данном случае правильный статус - 500 (Internal Server Error).
en: Loginom Integrator: If REST request was sent using HTTP POST method in Integrator, and an error occurred in the called package, 400 status (Bad Request) returned that was not true as in this case correct status was 500 (Internal Server Error).

source: Loginom Integrator: Если опубликовать пакет, открыть страницу Swagger UI Интегратора по протоколу http (по умолчанию http://localhost/lgi/openapi/index.html), а затем открыть страницу Swagger UI Интегратора с использованием протокола https, то в результате на странице Swagger UI и в сгенерированном OpenAPI документе был указан путь к серверу через http вместо https.
en: Loginom Integrator: If the package was published, Integrator Swagger UI page was opened via http protocol (by default http://localhost/lgi/openapi/index.html), and then Integrator Swagger UI page was opened using https protocol, path to the server via http instead of https was specified on Swagger UI page and in the generated OpenAPI document.

source: Loginom Integrator: добавлена периодическая проверка соединения с сервером.
en: Loginom Integrator: periodic check of server connection was added.

source: Loginom Intergator: В OpenAPI устранена генерация "nullable": true для свойств, которые не должны принимать значение null:
en: Loginom Intergator:Generation of "nullable": true was eliminated in OpenAPI for the properties that must not take null value:

source: Loginom Server: Исправлена ошибка «Access Violation», которая возникала при работе под Linux во время чтения ошибочных или битых конфигурационных файлов сервера (Settings.cfg, Users.cfg и др.).
en: Loginom Server: "Access Violation" error was corrected. It occurred in Linux while reading erroneous or damaged configuration server files (Settings.cfg, Users.cfg, etc).

source: Loginom Server: Исправлена ошибка, которая возникала в Диспетчере при попытке остановить выполнение пакета в сессии, созданной из BatchLauncher.
en: Loginom Server: The error that occurred in the Session Manager while attempting to stop the package execution in the session created from BatchLauncher was corrected.

source: Loginom Server: при обновлении или перезапуске службы сервера параметры LDAP сбрасывались до параметров по умолчанию (#8207).
en: Loginom Server: when updating or restarting the server service, LDAP parameters were reset to the default parameters (#8207).

source: Loginom Server: Исправлена ошибка Access violation, которая возникала при открытии зашифрованного пакета на Linux версии Loginom, развернутой на машине с устаревшим процессором без поддержки AES-NI (#9640).
en: Loginom Server: Access violation error was corrected. It occurred when opening encrypted package in the Linux Loginom version using the computer with the out-dated processor without AES-NI support (#9640).

source: Loginom Server: при одновременном завершении нескольких сессий с взаимосвязанными пакетами могла возникать ошибка «Значение индекса параметра Items вне диапазона», которая записывалась в лог сервера (#8470).
en: Loginom Server: when several sessions with interconnected packages were simultaneously completed, the following error could occur: "Index value of Items parameter is out of range" that was recorded in the server log (#8470).

source: Loginom Server: добавлен перехват и логирование исключения при закрытии пакета, выполняемого через Loginom Integrator.
en: Loginom Server: intercepting and logging of exclusion when closing the package executed via Loginom Integrator were added.

source: Python: Исправлен конфликт доступа к /dev/shm/loginom.
en: Python: /dev/shm/loginom access conflict was eliminated.

source: Python: Исправлена работа узла с большими строковыми значениями в режиме выполнения внутри процесса.
en: Python: The node operation with large string values in the execution mode inside the process was corrected.

source: Python: При использовании Python 3.9.x запуск скриптов внутри процесса Loginom приводил к ошибке "Access violation".
en: Python: When using Python 3.9.x, start of scripts inside the Loginom process caused "Access violation" error.

source: Python: исправлена ошибка утечки памяти при использовании Python.
en: Python: The memory leak error while Python using was corrected.

source: Python: Исправлена ошибка "Не удалось запустить /usr/bin/python", которая возникала в Loginom под Linux, установленном в докер-контейнер на AstraLinux SE (#9843).
en: Python: The following error was corrected: "Failed to start /usr/bin/python". It occurred in Loginom for Linux installed in docker container on AstraLinux SE (#9843).

source: Python: Исправлена работа Python с модулем numexpr в режиме выполнения кода Python внутри процесса.
en: Python: The Python operation with numexpr module was corrected in the Python code execution mode inside the process.

source: Python: исправлена ошибка «"" не является допустимым номером версии.
en: Python: The following error was corrected: """ is not allowable version number.

source: Python: функция builtin_pandas_utils.to_data_frame доработана таким образом, чтобы была возможность создания pandas.DataFrame по целочисленным и логическим столбцам, содержащим пропуски.
en: Python: builtin_pandas_utils.to_data_frame function was improved to provide the possibility of pandas.DataFrame creation by the integer and logical columns containing null data.

source: Python: при использовании Python 3.6 и ниже, если путь к библиотеке python.dll содержал символы кириллицы, активация узла Python завершалась с ошибкой: "SyntaxError: (unicode error) 'utf-8' codec can't decode byte... invalid start byte...".
en: Python: when using Python 3.6 and lower if the path to python.dll library contained the Cyrillic characters, activation of Python node was finished with the following error: "SyntaxError: (unicode error) 'utf-8' codec can't decode byte... invalid start byte...".

source: REST-запрос: Если в сценарии, подготовленном до версии 7.0.0, в узле REST-запрос была настроена связь поля с параметром, в имени которого присутствовал символ $, то после открытия сценария в Loginom 7.0.0 эта связь пропадала.
en: REST request: If the field was connected with the parameter the name of which contained $ character in the workflow prepared up to 7.0.0 version, after workflow opening in Loginom 7.0.0, this connection was lost.

source: REST-запрос: Исправлена ошибка "Нераспознанная структура сообщения", которая в некоторых случаях возникала в узле REST-запрос при установленной опции "Имитировать запрос с ответом в файле" (#6239).
en: REST request: The following error was corrected: "Unrecognized message structure". In some cases it occurred in REST request when the following option was selected: "Simulate request with response in a file" (#6239).

source: REST-запрос: если ответ на запрос содержал 4-байтные символы в кодировке UTF-8, то выходной порт с ответом содержал пустое значение, а второй выходной порт содержал код завершения 8 и сообщение об ошибке «Ошибка при обработке ответа сервера: Необработанная ошибка: СООБЩЕНИЕ: Кодовая единица ... не является началом UTF8 символа из не более чем 3 кодовых единиц» (#8373).
en: REST Request: if the request response contained 4-byte UTF-8 encoded characters, the output port with the response contained the null value, and the second output port contained 8 error code and the following error message: "Error processing server response: Unhandled error: MESSAGE: Code unit ... is not the start of UTF8 character that consists of not more than 3 code units" (#8373).

source: SOAP-запрос: В узле SOAP-запрос исправлено дублирование заголовка Content-Length в запросе.
en: SOAP request: Duplication of Content-Length header in the request was corrected in SOAP request node.

source: SOAP-запрос: Не распознавался Content-Type ответа при использовании mime:content в wsdl.
en: SOAP request: Content-Type of the response was not recognized when using mime:content in wsdl.

source: SOAP-запрос: если WSDL-схема содержала два элемента с одинаковым именем, один из которых являлся корневым, то при отправке запроса возникала ошибка «XSD-схема на входе не соответствует настройкам обработчика!» (#6179).
en: SOAP request: if WSDL schema contained two items with the same names one of which was the root one, the following error occurred while request sending: "Input XSD schema does not comply with the node settings!" (#6179).

source: SOAP-запрос: при одновременной активации нескольких подключений в разных потоках (например, при использовании «Цикла») иногда возникала ошибка, которая приводила к зависанию узла (его блокировке).
en: SOAP request: When several connections were simultaneously activated in different threads (for example, when "Loop" was used), sometimes an error occurred, and it froze the node (it was blocked).

source: Автоматическая синхронизация полей: при включении и выключении автоматической синхронизации полей на портах Базового узла, Производный узел не помечался как измененный (#6087).
en: Automapping of fields: when enabling and disabling automapping of fields on the Base node ports, the Derived node was not marked as the changed one (#6087).

source: Администрирование: исправлена ситуация, когда при первом запуске «Loginom Desktop» и переходе в настройки параметров приложения отображалось, что локаль изменена.
en: Administration: During the first "Loginom Desktop" start and transfer to the application parameters settings it was incorrectly displayed that the locale had been chaged. This error was corrected.

source: Администрирование: при единоразовом добавлении большого количества пользователей подряд (более двадцати) приложение могло «зависнуть» (#8220).
en: Administration: when many users (more than twenty) were added in succession at one point, the application could be "frozen" (#8220).

source: Администрирование: если принудительно закрывался пакет, содержащий активные процессы, а затем пользователь с ролью «Администратор» открывал панель Диспетчер, то этот пользователь получал ошибку «При переходе на "Администрирование.Диспетчер" возникла ошибка» (#8326).
en: Administration: if the package that contained active processes was forcibly closed, and then the Administrator user opened the Session Manager bar, this user came across the following error: "When switching to "Administration.Session Manager", error occurred" (#8326).

source: Ассоциативные правила: Исправлена регрессионная ошибка "Access violation", которая появилась в версии 7.0.0 и возникала, если остановить процесс обучения узла, зайти в мастер настройки, изменить любой параметр, сохранить настройки и запустить узел на переобучение (#10067).
en: Association rules: "Access violation" regression error was corrected. It appeared in version 7.0.0 and it occurred if the user stopped the node training process, entered the wizard, changed any parameter, saved the settings and started the node retraining (#10067).

source: Быстрый просмотр: при копировании в буфер обмена в некоторых случаях многострочные значения копировались без экранирующих кавычек (#8138).
en: Quick View: when copying to the clipboard, in some cases multiline values were copied without shielding quotes (#8138).

source: Быстрый просмотр: Если Быстрый просмотр первоначально был открыт в режиме плавающего окна, затем закрыт, а узел деактивирован, то при повторной активации узла и открытии Быстрого просмотра ширина колонок вычислялась неверно и пользователь получал данные в узких колонках.
en: Quick view: If Quick view was initially opened in the floating window mode and then in was closed, whereas the node was deactivated, the column width was incorrectly calculated, and a user received data in the narrow columns when activating the node repeatedly and opening Quick view.

source: Быстрый просмотр: При работе в Google Chrome в Быстром просмотре узла с большим объемом данных (например, если в наборе есть очень длинные строки (более 5 млн.
en: Quick view: When working in Google Chrome in the Quick view node with large amount of data (for example, if there are very long strings in the data set (exceeding 5 million of

source: Быстрый просмотр: в детализации Быстрого просмотра значения элементов с типом «Переменный» отображались как (#8630).
en: Quick view: in the Quick view detailing, values of the items with "Variable" type were displayed as (#8630).

source: Быстрый просмотр: исправлена ошибка "Cannot read properties of null (reading 'each')", которая возникала, если во время открытия Быстрого просмотра быстро закрыть вкладку Сценарий (#9019).
en: Quick view: the following error was corrected "Cannot read properties of null (reading 'each')". It occurred if after Quick view opening, Workflow tab was quickly closed (#9019).

source: Визуализатор «Диаграмма»: исправлена ошибка с сохранением параметров, которая иногда могла возникать, если сразу после их изменения в любом модальном окне диаграммы быстро нажать кнопку «Применить».
en: "Chart" visualizer: The error connected with parameters saving was corrected. It could sometimes occur when "Apply" button was quickly pressed right after parameters change in any modal chart window.

source: Визуализатор «Диаграмма»: исправлен порядок отрисовки столбцов в столбчатой диаграмме в режиме накопления.
en: "Chart" visualizer: the order of column drawing in the bar chart was corrected in the accumulation mode.

source: Визуализатор «Качество данных»: исправлена ошибка в визуализаторе, которая возникала после добавления поля с логическим типом к имеющимся и повторным расчетом (#9095, #9085).
en: "Data Quality" visualizer: the visualizer error was corrected. It occurred when the field with the logical type was added to the existing and repeated calculation (#9095, #9085).

source: Визуализатор «Качество данных»: исправлена ошибка конвертирования при отображении целочисленных значений.
en: "Data Quality" visualizer: The conversion error while displaying the integer values was corrected.

source: Визуализатор «Качество данных»: исправлено отсутствие строк в таблице Детализация для выбросов дискретных полей.
en: "Data Quality" visualizer: absence of rows in Detailing table was corrected for outliers of discrete fields.

source: Визуализатор «Куб»: копирование и вставка были доступны только во множественном режиме «Куба», при этом режим «включенных/исключенных значений» никак не влиял на операцию.
en: "Cube" visualizer: Copy and paste operations were available only in the multiple "Cube" mode. In this case, the "included/excluded values" mode had no effect on the operation.

source: Визуализатор «Куб»: выпадающие списки полей у кнопок добавления измерений и у фактов в окне настройки фактов некорректно отображали отфильтрованный список полей.
en: "Cube" visualizer: The drop-down lists of fields near buttons required for addition of dimensions and near measures in the measures configuration window incorrectly displayed the filtered list of fields.

source: Визуализатор Диаграмма: При экспорте диаграммы в PDF, если высота изображения превышала ширину, ее нижняя часть была обрезана.
en: Chart visualizer: When exporting the chart to PDF, its lower part was cut if the image height exceeded the width.

source: Визуализатор Качество бинарной классификации: На диаграмме точности не отображались линии графиков NPV и OPR, хотя маркеры для них отображались (т.е. графики были построены).
en: Binary сlassification assessment visualizer: NPV and OPR graph lines were not displayed on the accuracy chart, although markers designated for them were displayed (namely, the charts were constructed).

source: Визуализатор Качество данных: Исправлена ошибка "Cannot read properties of undefined (reading 'isGroupHeader')", которая возникала при активации визуализатора Качество данных со страницы Отчеты, без предварительного входа в визуализатор со страницы Визуализаторы (#9470).
en: Data quality visualizer: The following error was corrected: "Cannot read properties of undefined (reading 'isGroupHeader')". It occurred when activating Data quality visualizer from the Reports page without prior entering the visualizer from the Visualizers page (#9470).

source: Визуализатор Конечные классы: Не рассчитывалась статистика в визуализаторе Конечные классы для обученного узла, в качестве входного поля которого выбрано дискретное поле.
en: Coarse сlasses visualizer: Statistics was not calculated in Coarse classes visualizer for the trained node the discrete field of which was selected as the input field.

source: Визуализатор Куб: Исправлена регрессионная ошибка, при которой в некоторых случаях часть серий диаграммы Куба теряла настроенный цвет, если после изменения цвета серий на диаграмме перейти к сценарию, а затем снова вернуться к визуализатору (#10016).
en: Cube visualizer: The regression error was corrected. It caused the following problem: in some cases a part of the Cube chart series lost the set color if the user went to the workflow after series color change in the chart and then returned to the visualizer again (#10016).

source: Визуализатор Куб: В некоторых случаях идентификаторы заголовков Куба передавались с сервера в урезанном виде.
en: Cube visualizer: In some cases, identifiers of the Cube headers were transferred from the server in the reduced form.
